tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "isen-ng/dotnet-sdk-versions"
brew "automake"
brew "node"
brew "aws-cdk", link: false
brew "awscli", link: false
brew "fontconfig"
brew "gettext"
brew "python@3.12"
brew "pixman"
brew "cask"
brew "docker", link: false
brew "dotnet@6"
brew "gdk-pixbuf"
brew "git"
brew "go"
brew "harfbuzz"
brew "intltool"
brew "jupyterlab"
brew "libcroco"
brew "libffi"
brew "nginx"
brew "openjdk"
brew "pango"
brew "python-setuptools"
brew "python@3.10"
brew "shared-mime-info"
brew "socat"
brew "yarn"
cask "azure-data-studio"
cask "discord"
cask "docker"
cask "dotnet-sdk"
cask "google-chrome"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "rider"
cask "slack"
cask "soundflower"
cask "visual-studio-code"
cask "vmware-fusion"
cask "zoom"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.dotnet-test-explorer"
vscode "franneck94.c-cpp-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.dotnet-maui"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.powershell"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "orta.vscode-jest"
vscode "postman.postman-for-vscode"
vscode "redhat.vscode-yaml"
vscode "ryu1kn.partial-diff"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
