tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "isen-ng/dotnet-sdk-versions"
brew "automake"
brew "awscli"
brew "fontconfig"
brew "gettext"
brew "pixman"
brew "cask"
brew "docker", link: false
brew "gdk-pixbuf"
brew "git"
brew "go"
brew "harfbuzz"
brew "intltool"
brew "libcroco"
brew "libffi"
brew "node"
brew "pango"
brew "shared-mime-info"
brew "socat"
brew "yarn"
cask "azure-data-studio"
cask "docker"
cask "dotnet-sdk"
cask "firefox"
cask "google-chrome"
cask "slack"
cask "soundflower"
cask "virtualbox"
cask "visual-studio-code"
cask "zoom"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "DotJoshJohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "emilast.LogFileHighlighter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "Ionide.Ionide-fsharp"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.powershell"
vscode "msjsdiag.vscode-react-native"
vscode "Postman.postman-for-vscode"
vscode "redhat.vscode-yaml"
vscode "ryu1kn.partial-diff"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
