tap "isen-ng/dotnet-sdk-versions"
brew "node"
brew "aws-cdk", link: false
brew "awscli", link: false
brew "git"
brew "go"
brew "jupyterlab"
brew "nginx"
brew "openjdk"
brew "python@3.12"
brew "shellcheck"
brew "socat"
brew "yarn"
cask "brave-browser"
cask "claude-code"
cask "discord"
cask "dotnet-sdk"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "rancher"
cask "rider"
cask "slack"
cask "visual-studio-code"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.dotnet-test-explorer"
vscode "github.vscode-pull-request-github"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.powershell"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "orta.vscode-jest"
vscode "postman.postman-for-vscode"
vscode "redhat.vscode-yaml"
vscode "ryu1kn.partial-diff"
vscode "tomoki1207.pdf"
